aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c

/*
 * File:   main.c
 * Author: ICE_MEGANE
 *
 * Created on 2020/03/5, 22:26
 */

#include <xc.h>
#include "../userdefine.h"

#include "mcu_setup.h"

/* 関数プロトタイプ宣言 */
static void func_mset_s_option_reg_setup( void );
static void func_mset_s_oscillator_setup( void );
static void func_mset_s_int_setup( void );
static void func_mset_s_port_setup( void );
static void func_mset_s_adc_setup( void );

static void func_mset_s_ccp_setup( void );
static void func_mset_s_timer_setup( void );
static void func_mset_s_timer0_setup( void );
static void func_mset_s_timer2_setup( void );
static void func_mset_s_timer4_setup( void );
static void func_mset_s_timer6_setup( void );

/**************************************************************/
/*  Function:                                                 */
/*  レジスタ初期設定                                            */
/*                                                            */
/**************************************************************/
void func_mset_g_init( void )
{
    func_mset_s_option_reg_setup();     /* オプションレジスタ設定 */
    func_mset_s_oscillator_setup();     /* マイコンクロック設定  */
    func_mset_s_int_setup();            /* 割り込み設定         */
    func_mset_s_port_setup();           /* ポート設定           */
    func_mset_s_adc_setup();            /* AD変換設定           */
    func_mset_s_timer_setup();          /* タイマ設定           */
}


/**************************************************************/
/*  Function:                                                 */
/*  プログラム開始直前の設定                                    */
/*                                                            */
/**************************************************************/
void func_mset_g_mcu_start_condition( void )
{
    INTCON |= 0x80U;     /* 全体割り込み 許可 */
    ADCON0 |= 0x00U;     /* AD変換器 動作許可 */
}

    /* テンプレ */
    /*========================================================================================*/
                            /*  +-------------------------------------------- 15 :            */
                            /*  | +------------------------------------------ 14 :            */
                            /*  | | +---------------------------------------- 13 : FCMEN      */
                            /*  | | | +-------------------------------------- 12 : TMR0SE     */
                            /*  | | | |                                                       */
                            /*  | | | |     +-------------------------------- 11 : PSA        */
                            /*  | | | |     | +------------------------------ 10 : PS<2>      */
                            /*  | | | |     | | +---------------------------- 9  : PS<1>      */
                            /*  | | | |     | | | + ------------------------- 8  : PS<0>      */
                            /*  | | | |     | | | |     +-------------------- 7  :            */
                            /*  | | | |     | | | |     | +------------------ 6  :            */
                            /*  | | | |     | | | |     | | +---------------- 5  :  FCMEN     */
                            /*  | | | |     | | | |     | | | +-------------- 4  : TMR0SE     */
                            /*  | | | |     | | | |     | | | |                               */
                            /*  | | | |     | | | |     | | | |     +-------- 3  : PSA        */
                            /*  | | | |     | | | |     | | | |     | +------ 2  : PS<2>      */
                            /*  | | | |     | | | |     | | | |     | | +---- 1  : PS<1>      */
                            /*  | | | |     | | | |     | | | |     | | | +-- 0  : PS<0>      */
                            /*  | | | |     | | | |     | | | |     | | | |                   */
                            /*  0 0 0 0  -  0 1 1 0  -  0 0 0 0  -  0 0 0 0                   */
    /*----------------------------------------------------------------------------------------*/
    /* memo                                                                                   */
    /*                                                                                        */
    /*========================================================================================*/

/**************************************************************/
/*  Function:                                                 */
/*  オプションレジスタ初期設定                                   */
/*  クロックより先に設定したほうがよさそう                        */
/**************************************************************/
static void func_mset_s_option_reg_setup( void )
{

}


/**************************************************************/
/*  Function:                                                 */
/*  クロック初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_oscillator_setup( void )
{
    /* クロック周波数設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : SPLLEN  */ /* PLL 無効化 ※#pragmaセクションで設定したので、実際は常時許可状態(datasheet P.67) */
                            /*  | +----------------------- 6 : IRCF<3> */ /* 1111 : 16MHz HFINTOSC に設定 */
                            /*  | | +--------------------- 5 : IRCF<2> */ 
                            /*  | | | +------------------- 4 : IRCF<1> */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : IRCF<0> */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : SCS<1>  */ /* 00 : FOSC ※#pragmaセクションで設定している */
                            /*  | | | |     | | | + ------ 0 : SCS<0>  */
    //OSCCON =  0x78U;        /*  0 1 1 1  -  1 # 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


