aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* クロック周波数微調整 */
    /*=================================================================*/

                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : TUN5    */
                            /*  | | | +------------------- 4 : TUN4    */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TUN3    */
                            /*  | | | |     | +----------- 2 : TUN2    */
                            /*  | | | |     | | +--------- 1 : TUN1    */
                            /*  | | | |     | | | + ------ 0 : TUN0    */
    OSCTUNE =  0x00U;       /*  0 0 0 0  -  0 0 1 1                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 特に調整するつもりはないので初期設定                               */
    /*=================================================================*/


    /* Option register setup */
    /* 今回は#pragmaセクションで設定したので、設定しなくてもOK。 */

}


/**************************************************************/
/*  Function:                                                 */
/*  割り込み初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_int_setup( void )
{
    /* 割り込み設定 */
    /*=================================================================*/
                            /*  +------------------------- 7 : GIE     */   /* 全体割り込み 許可 */
                            /*  | +----------------------- 6 : PEIE    */   /* ペリフェラル割り込み 許可 */
                            /*  | | +--------------------- 5 : TMR0IE  */   /* タイマ0割り込み 許可 */
                            /*  | | | +------------------- 4 : INTE    */   /* 外部割込み 禁止 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : IOCIE   */   /* 外部ピン変化割り込み 禁止 */
                            /*  | | | |     | +----------- 2 : TMR0IF  */   /* タイマ0 オーバーフロー割り込みフラグ */
                            /*  | | | |     | | +--------- 1 : INTF    */   /* 外部割込みフラグ クリア */
                            /*  | | | |     | | | + ------ 0 : IOCIF   */   /* 外部ピン変化割り込みフラグ クリア */
    INTCON =  0x60U;        /*  0 1 1 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 初期化時点では全体割り込みは無効化しておく                          */
    /*=================================================================*/


    /* 割り込み設定 */
    /*=================================================================*/

                            /*  +------------------------- 7 : TMR1GIE */
                            /*  | +----------------------- 6 : ADIE    */   /* AD変換完了割り込み 有効 */
                            /*  | | +--------------------- 5 : RCIE    */
                            /*  | | | +------------------- 4 : TXIE    */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SSP1IE  */
                            /*  | | | |     | +----------- 2 : CCP1IE  */
                            /*  | | | |     | | +--------- 1 : TMR2IE  */
                            /*  | | | |     | | | + ------ 0 : TMR1IE  */
    PIE1 = 0x40U;           /*  0 0 0 0  -  0 0 1 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* 割り込み設定 */
    /*=================================================================*/

                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : CCP4IE  */   /* CCP4割り込み 禁止 */
                            /*  | | | +------------------- 4 : CCP3IE  */   /* CCP3割り込み 禁止 */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TMR6IE  */   /* タイマ6 一致割り込み 禁止 */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : TMR4IE  */   /* タイマ4 一致割り込み 禁止 */
                            /*  | | | |     | | | + ------ 0 : -       */
    PIE3 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* 割り込み設定 */
    /*=================================================================*/

                            /*  +------------------------- 7 : TMR1GIF */
                            /*  | +----------------------- 6 : ADIF    */
                            /*  | | +--------------------- 5 : RCIF    */
                            /*  | | | +------------------- 4 : TCIF    */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : SSP1IF  */
                            /*  | | | |     | +----------- 2 : CCP1IF  */
                            /*  | | | |     | | +--------- 1 : TMR2IF  */
                            /*  | | | |     | | | + ------ 0 : TMR1IF  */
    PIR1 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                   */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* 割り込み設定 */
    /*=================================================================*/

                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : CCP4IF  */   /* CCP4割り込みフラグ クリア */
                            /*  | | | +------------------- 4 : CCP3IF  */   /* CCP3割り込みフラグ クリア */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TMR6IF  */   /* タイマ6 一致割り込みフラグ クリア */
                            /*  | | | |     | +----------- 2 : -       */
                            /*  | | | |     | | +--------- 1 : TMR4IF  */   /* タイマ4 一致割り込みフラグ クリア */
                            /*  | | | |     | | | + ------ 0 : -       */
    PIR3 = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  ポート初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_port_setup( void )
{
    /* ポート入出力方向設定：A */
    /*=================================================================*/

                            /*  +------------------------- 7 : TRISA7  */
                            /*  | +----------------------- 6 : TRISA6  */
                            /*  | | +--------------------- 5 : TRISA5  */
                            /*  | | | +------------------- 4 : TRISA4  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TRISA3  */ /* RA3:入力 */
                            /*  | | | |     | +----------- 2 : TRISA2  */ /* RA2:入力 */
                            /*  | | | |     | | +--------- 1 : TRISA1  */
                            /*  | | | |     | | | + ------ 0 : TRISA0  */
    TRISA = 0x0CU;          /*  0 0 0 0  -  1 1 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:出力、1:入力                                                   */
    /* RA4は入力専用ポートなので注意                                     */
    /*=================================================================*/

    /* ポート入出力方向設定：B */
    /*=================================================================*/

                            /*  +------------------------- 7 : TRISB7  */
                            /*  | +----------------------- 6 : TRISB6  */
                            /*  | | +--------------------- 5 : TRISB5  */
                            /*  | | | +------------------- 4 : TRISB4  */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : TRISB3  */
                            /*  | | | |     | +----------- 2 : TRISB2  */
                            /*  | | | |     | | +--------- 1 : TRISB1  */
                            /*  | | | |     | | | + ------ 0 : TRISB0  */
    TRISB = 0x00U;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /* 0:出力、1:入力                                                   */
    /* RA4は入力専用ポートなので注意                                     */
    /*=================================================================*/


    /* ポート読み取りデータ初期化：A */
    /*=================================================================*/

                            /*  +------------------------- 7 : RA7     */
                            /*  | +----------------------- 6 : RA6     */
                            /*  | | +--------------------- 5 : RA5     */
                            /*  | | | +------------------- 4 : RA4     */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RA3     */
                            /*  | | | |     | +----------- 2 : RA2     */
                            /*  | | | |     | | +--------- 1 : RA1     */
                            /*  | | | |     | | | + ------ 0 : RA0     */
    PORTA = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


