aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/mcufunc/mcu_setup.c
    /* ポート読み取りデータ初期化：B */
    /*=================================================================*/

                            /*  +------------------------- 7 : RB7     */
                            /*  | +----------------------- 6 : RB6     */
                            /*  | | +--------------------- 5 : RB5     */
                            /*  | | | +------------------- 4 : RB4     */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : RB3     */
                            /*  | | | |     | +----------- 2 : RB2     */
                            /*  | | | |     | | +--------- 1 : RB1     */
                            /*  | | | |     | | | + ------ 0 : RB0     */
    PORTB = 0x00U;           /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/


    /* GPIO or AD変換選択：A */
    /*=================================================================*/
                            /*  +------------------------- 7 : -       */
                            /*  | +----------------------- 6 : -       */
                            /*  | | +--------------------- 5 : -       */
                            /*  | | | +------------------- 4 : ANSA4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : ANSA3   */   /* RA3 アナログ入力 */
                            /*  | | | |     | +----------- 2 : ANSA2   */   /* RA2 アナログ入力 */
                            /*  | | | |     | | +--------- 1 : ANSA1   */
                            /*  | | | |     | | | + ------ 0 : ANSA0   */
    ANSELA = 0x0CU;         /*  0 0 0 0  -  1 1 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/

    /* GPIO or AD変換選択：B */
    /*=================================================================*/
                            /*  +------------------------- 7 : ANSB7   */
                            /*  | +----------------------- 6 : ANSB6   */
                            /*  | | +--------------------- 5 : ANSB5   */
                            /*  | | | +------------------- 4 : ANSB4   */
                            /*  | | | |                                */
                            /*  | | | |     +------------- 3 : ANSB3   */
                            /*  | | | |     | +----------- 2 : ANSB2   */
                            /*  | | | |     | | +--------- 1 : ANSB1   */
                            /*  | | | |     | | | + ------ 0 : -       */
    ANSELB = 0x00U;          /*  0 0 0 0  -  0 0 0 0                    */
    /*-----------------------------------------------------------------*/
    /* memo                                                            */
    /*                                                                 */
    /*=================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  AD変換初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_adc_setup( void )
{
    /* AD変換設定1 */
    /*==================================================================*/
                            /*  +------------------------- 7 : -        */
                            /*  | +----------------------- 6 : CHS4     */
                            /*  | | +--------------------- 5 : CHS3     */
                            /*  | | | +------------------- 4 : CHS2     */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : CHS1     */
                            /*  | | | |     | +----------- 2 : CHS0     */  /* 初期化時はいったん AN0指定 */
                            /*  | | | |     | | +--------- 1 : GO/nDONE */  /* 初期化時は実行しない */
                            /*  | | | |     | | | + ------ 0 : ADON     */  /* 初期化時にAD変換ユニット 無効化 -> プログラム開始時にONする */
    ADCON0 = 0x00U;         /*  0 0 0 0  -  0 0 0 1                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /*                                                                  */
    /*==================================================================*/

    /* AD変換設定2 */
    /*==================================================================*/
                            /*  +------------------------- 7 : ADFM     */  /* 右詰め LSBから埋めてく */
                            /*  | +----------------------- 6 : ADCS2    */
                            /*  | | +--------------------- 5 : ADCS1    */
                            /*  | | | +------------------- 4 : ADCS0    */  /* 110:クロック32MHzのため、Fosc/64に設定 */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : -        */
                            /*  | | | |     | +----------- 2 : ADNREF   */  /* 負側の電位基準：VSS(GND) */
                            /*  | | | |     | | +--------- 1 : ADPREF1  */
                            /*  | | | |     | | | + ------ 0 : ADPREF0  */  /* 正側の電位基準：AVDD */
    ADCON1 = 0xA0U;         /*  1 0 1 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /*                                                                  */
    /*==================================================================*/

    /* AD変換設定3 */
    /*==================================================================*/
                            /*  +------------------------- 7 : -        */
                            /*  | +----------------------- 6 : -        */
                            /*  | | +--------------------- 5 : -        */
                            /*  | | | +------------------- 4 : -        */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : -        */
                            /*  | | | |     | +----------- 2 : -        */
                            /*  | | | |     | | +--------- 1 : ADRES9   */
                            /*  | | | |     | | | + ------ 0 : ADRES8   */
    ADRESH = 0x00U;         /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* ADFMの設定内容によって右詰め、左詰め変わるので注意                   */
    /*==================================================================*/

    /* AD変換設定3 */
    /*==================================================================*/
                            /*  +------------------------- 7 : ADRES7   */
                            /*  | +----------------------- 6 : ADRES6   */
                            /*  | | +--------------------- 5 : ADRES5   */
                            /*  | | | +------------------- 4 : ADRES4   */
                            /*  | | | |                                 */
                            /*  | | | |     +------------- 3 : ADRES3   */
                            /*  | | | |     | +----------- 2 : ADRES2   */
                            /*  | | | |     | | +--------- 1 : ADRES1   */
                            /*  | | | |     | | | + ------ 0 : ADRES0   */
    ADRESL = 0x00U;         /*  0 0 0 0  -  0 0 0 0                     */
    /*------------------------------------------------------------------*/
    /* memo                                                             */
    /* ADFMの設定内容によって右詰め、左詰め変わるので注意                   */
    /*==================================================================*/
}


/**************************************************************/
/*  Function:                                                 */
/*  タイマ初期設定                                            */
/*                                                            */
/**************************************************************/
static void func_mset_s_timer_setup( void )
{
    func_mset_s_timer0_setup();     /* メインタスク用 タイマ0 */

